In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('sample_dataset_1000.csv')

In [5]:
df.head()

,ID,Name,Age,Gender,Salary,Joining Date,Is Active,Comments
0,1,Paul,25,Female,90041.86,2017-01-31,False,Creative
1,2,Paul,31,Male,90285.02,2019-05-29,False,Needs Improvement
2,3,Rachel,30,Male,84321.65,2022-12-14,False,Hardworking
3,4,Bob,45,Male,68189.99,2023-09-05,True,Fast Learner
4,5,Eve,34,Male,35428.35,2018-05-19,True,Dedicated

In [6]:
df.shape

(1000, 8)

In [7]:
df.dtypes

ID                int64
Name             object
Age               int64
Gender           object
Salary          float64
Joining Date     object
Is Active          bool
Comments         object
dtype: object

In [ ]:
x = df[['Joining Date']]  # using double brackets make dataframe
x.shape
# type(x)

pandas.core.frame.DataFrame

In [9]:
x.head()

  Joining Date
0   2017-01-31
1   2019-05-29
2   2022-12-14
3   2023-09-05
4   2018-05-19

In [11]:
x = df['Joining Date']  # using single brackets make series
x.shape
type(x)

pandas.core.series.Series

**series are one dimentional and dataframes are 2 dimensional**